{"query": "Szechwan dish food cuisine", "hits": [["<dbpedia:Ghanaian_cuisine>", 26.876383], ["<dbpedia:Seafood_dishes>", 26.548752], ["<dbpedia:Dish_(food)>", 25.399784], ["<dbpedia:American_Chinese_cuisine>", 25.048447], ["<dbpedia:List_of_Indian_dishes>", 24.802492], ["<dbpedia:Traditional_food>", 23.69577], ["<dbpedia:Malaysian_Indian_cuisine>", 23.627056], ["<dbpedia:Cuisine_of_Odisha>", 23.530985], ["<dbpedia:Cuisine>", 23.505045], ["<dbpedia:Gabonese_cuisine>", 23.364717]], "docs": {"<dbpedia:Ghanaian_cuisine>": {"text": "Ghanaian cuisine is the cuisine of the Ghanaian people. Ghanaian main dishes are organized around a starchy staple food, with which goes a sauce or soup containing a protein source.", "title": "Ghanaian cuisine"}, "<dbpedia:Seafood_dishes>": {"text": "Seafood dishes or fish dishes are distinct food dishes which use seafood (fish, shellfish or seaweed) as primary ingredients, and are ready to be served or eaten with any needed preparation or cooking completed. Seafood dishes are usually developed within a cuisine or characteristic style of cooking practice and tradition, often associated with a specific culture. A cuisine is primarily influenced by the ingredients that are available locally or through trade.", "title": "Seafood dishes"}, "<dbpedia:Dish_(food)>": {"text": "A dish in gastronomy is a specific food preparation, a \"distinct article or variety of food,\" with cooking finished, and ready to eat, or be served.A dish may be served on tableware, or may be eaten out of hand; but breads are generally not called dishes.Instructions for preparing a dish are called recipes.", "title": "Dish (food)"}, "<dbpedia:American_Chinese_cuisine>": {"text": "American Chinese cuisine, known in the United States as simply Chinese cuisine, is a style of food developed by Americans of Chinese descent and served in many North American Chinese restaurants. The dishes typically served in restaurants cater to American tastes and differ significantly from Chinese cuisine in China itself. Although China has various regional cuisines, Cantonese cuisine has been the most influential regional cuisine in the development of American Chinese food.", "title": "American Chinese cuisine"}, "<dbpedia:List_of_Indian_dishes>": {"text": "This is a list of Indian dishes. Indian cuisine encompasses a wide variety of regional cuisines native to  India. Given the range of diversity in soil type, climate and occupations, these cuisines vary significantly from each other and use locally available spices, herbs, vegetables and fruits. The dishes are then served according to taste in either mild, medium or hot. Indian food is also heavily influenced by religious and cultural choices and traditions.", "title": "List of Indian dishes"}, "<dbpedia:Traditional_food>": {"text": "Traditional food refers to foods consumed over the long-term duration of civilization through generations, and foods and dishes that are traditional or have a historic precedent in a national, regional or local cuisine. Traditional foods and beverages may be produced as homemade, by restaurants and small manufacturers, and by large food processing plant facilities. This article also includes information about traditional beverages.", "title": "Traditional food"}, "<dbpedia:Malaysian_Indian_cuisine>": {"text": "Malaysian Indian cuisine, or the cooking of the ethnic Indian communities in Malaysia consists of adaptations of authentic dishes from India, as well as original creations inspired by the diverse food culture of Malaysia.", "title": "Malaysian Indian cuisine"}, "<dbpedia:Cuisine_of_Odisha>": {"text": "Compared to other regional Indian cuisines, Odia cuisine used relatively less oil and is less spicy but of great taste. Rice is the staple food of this region. Mustard oil is used in several dishes as the cooking medium, but ghee is preferred in temples. Food is traditionally served on disposable plates made of sal leaves.Odia cooks, particular from the Puri region, were much sought after due to their ability to cook food in accordance to the Hindu scriptures.", "title": "Cuisine of Odisha"}, "<dbpedia:Cuisine>": {"text": "A cuisine (/kwɪˈziːn/ kwi-ZEEN; from French [kɥizin], in turn from Latin coquere = \"to cook\") is a style of cooking characterized by distinctive ingredients, techniques and dishes, and usually associated with a specific culture or geographic region. A cuisine is primarily influenced by the ingredients that are available locally or through trade. Religious food laws, such as Hindu, Islamic and Jewish dietary laws, can also exercise a strong influence on cuisine.", "title": "Cuisine"}, "<dbpedia:Gabonese_cuisine>": {"text": "Gabonese cuisine is the cooking traditions, practices, foods and dishes associated with Gabon, a sovereign state on the west coast of Central Africa. French cuisine is prevalent as a notable influence, and in larger cities various French specialties are available. In rural areas, food staples such as cassava, rice and yams are commonly used. Meats, when available, include chicken and fish, and bush meats such as antelope, wild boar and monkey.", "title": "Gabonese cuisine"}}}